#language: ru
@all
Функционал: Вход в gmail

  Предыстория:
    Тестируем новые фичи

  Структура сценария: авторизация на почте работает корректно
    Пусть открыт браузер и введен адрес сайта
    И пользователь вводит поисковый запрос в "Поле Поиска"
    И нажата кнопка "Кнопка Мне Повезёт!"


    Примеры:
      | login                 | пароль          | резервный email |адрес|шаг|
      | kotionb3505@gmail.com | KotionEachB3505 | sai0nara@ya.ru  |  http://google.com   |открыт браузер и введен адрес "<адрес>"|
#      | kotionb3505@gmail.com | KotionEachB3505 | sai0nara@ya.ru  |  http://mail.ru  | пользователь вводит "<login>"  |
